
/**
+----------------------------------------------------------
* 验证码图片
+----------------------------------------------------------
* @access  public
* @param   obj     obj
+----------------------------------------------------------
* @return  string
+----------------------------------------------------------
* @example validPic( $('#verifyImg') )
+----------------------------------------------------------
*/
function validPic( obj ) {
	$(obj).attr('src', consts('www') + "/Public/verify?" + Math.random());
}

/**
+----------------------------------------------------------
* 分页 - 判断直接填写跳转页码是否为空、是否为数字
+----------------------------------------------------------
* @access  public
* @param   obj     form
+----------------------------------------------------------
* @return  void
+----------------------------------------------------------
* @example isValid(this)
+----------------------------------------------------------
*/
function isValid ( form ) {
	if( form.cp.value == '' || isNaN(form.cp.value) || parseInt(form.cp.value) > parseInt($(".pageNum").last().attr("page")) || form.cp.value <= 0 ){
		alert("请正确填写数字!");
		return false;
	}
	return true;
}

/**
+----------------------------------------------------------
* UEditor 提交时,内容同步
+----------------------------------------------------------
* @access  public
+----------------------------------------------------------
* @return  void
+----------------------------------------------------------
* @example editorSync( MODULE_NAME )
+----------------------------------------------------------
*/
function editorSync() {
	$("textarea").each(function(){
		var str = $(this).attr('id');
		if( str.indexOf('editor') != '-1' ) UE.getEditor(str).sync();
	});
}


