<?php
return array (
  'SiteMap_index' => '网站地图',
  'WorkYear' => 
  array (
    0 => '不限',
    1 => '在读学生',
    2 => '应届毕业生',
    3 => '一年以上',
    4 => '二年以上',
    5 => '三年以上',
    6 => '五年以上',
    7 => '八年以上',
    8 => '十年以上',
  ),
  'PeovideSalary' => 
  array (
    0 => '面议',
    1 => '1500以下',
    2 => '1500-2999',
    3 => '3000-4499',
    4 => '4500-5999',
    5 => '6000-7999',
    6 => '8000-9999',
    7 => '10000-14999',
    8 => '15000-19999',
    9 => '20000-29999',
    10 => '30000-49999',
    11 => '50000及以上',
  ),
  'DegreeFrom' => 
  array (
    0 => '不限',
    1 => '初中',
    2 => '高中',
    3 => '中专',
    4 => '大专',
    5 => '本科',
    6 => '硕士',
    7 => '博士',
  ),
  'CycleType' => 
  array (
    0 => '请选择',
    1 => '每分钟',
    2 => '每小时',
    3 => '每天',
    4 => '每周',
    5 => '每月',
    6 => '每年',
  ),
  'Base_index' => '首页',
);
?>
