<?php
// +----------------------------------------------------------------------
// | ThinkPHP
// +----------------------------------------------------------------------
// | Copyright (c) 2007 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
// $Id$
class AdminBaseModel extends Model {

	/**
	+----------------------------------------------------------
	* 获取当前登陆用户信息
	+----------------------------------------------------------
	* @access protected
	+----------------------------------------------------------
	* @return array
	+----------------------------------------------------------
	*/
	protected function getUserInfo() {
		return $_SESSION[C('USER_AUTH_KEY')];
	}

	/**
	+----------------------------------------------------------
	* 根据主键ID查询数据(一维数组)
	+----------------------------------------------------------
	* @access public
	+----------------------------------------------------------
	* @param  array   $id   主键ID
	+----------------------------------------------------------
	* @return array
	+----------------------------------------------------------
	*/
	public function getInfoById( $id ) {
		return $this->query_first( "select * from {$this->trueTableName} where {$this->pk} = '{$id}' limit 1" );
	}

	/**
	+----------------------------------------------------------
	* 根据条件删除表数据
	+----------------------------------------------------------
	* @access public
	+----------------------------------------------------------
	* @param  array   $where   条件
	+----------------------------------------------------------
	* @return boolen
	+----------------------------------------------------------
	*/
	public function delete( $where, $field = 'status' ) {
		if( FALSE === $this->where($where)->setField($field,-1) ){
			$this->error = L('_OPERATION_WRONG_');
			return false;
		}else{
			return true;
		}
	}

	/**
	+----------------------------------------------------------
	* 根据条件禁用表数据
	+----------------------------------------------------------
	* @access public
	+----------------------------------------------------------
	* @param  array   $where   条件
	+----------------------------------------------------------
	* @return boolen
	+----------------------------------------------------------
	*/
	public function forbid( $where, $field = 'status' ) {
		if( FALSE === $this->where($where)->setField($field,0) ){
			$this->error = L('_OPERATION_WRONG_');
			return false;
		}else{
			return true;
		}
	}

	/**
	+----------------------------------------------------------
	* 根据条件批准表数据
	+----------------------------------------------------------
	* @access public
	+----------------------------------------------------------
	* @param  array   $where   条件
	+----------------------------------------------------------
	* @return boolen
	+----------------------------------------------------------
	*/
	public function checkPass( $where, $field = 'status' ) {
		if( FALSE === $this->where($where)->setField($field,1) ){
			$this->error = L('_OPERATION_WRONG_');
			return false;
		}else{
			return true;
		}
	}

	/**
	+----------------------------------------------------------
	* 根据条件恢复表数据
	+----------------------------------------------------------
	* @access public
	+----------------------------------------------------------
	* @param  array   $where   条件
	+----------------------------------------------------------
	* @return boolen
	+----------------------------------------------------------
	*/
	public function resume( $where, $field = 'status' ) {
		if( FALSE === $this->where($where)->setField($field,1) ){
			$this->error = L('_OPERATION_WRONG_');
			return false;
		}else{
			return True;
		}
	}

}
?>
