<?php
// +----------------------------------------------------------------------
// | ThinkPHP
// +----------------------------------------------------------------------
// | Copyright (c) 2007 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
// $Id$

class BaseProductCategoryBrandAction extends ABaseAction {

	/**
	+----------------------------------------------------------
	* 新增_插入
	+----------------------------------------------------------
	*/
	public function add_edit() {
		$this->vo = D( $this->getActionName() )->getBrandByCategory($_REQUEST['bpcid']);
		$this->display('add_edit');
	}

	/**
	+----------------------------------------------------------
	* 插入_更新
	+----------------------------------------------------------
	*/
	public function insert_update() {
		print_r($_REQUEST);
	}

}
?>
