<?php
// +----------------------------------------------------------------------
// | ThinkPHP
// +----------------------------------------------------------------------
// | Copyright (c) 2007 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
// $Id$

class BaseAreaAction extends ACategoryAction {

	/**
	+----------------------------------------------------------
	* 新增前置
	+----------------------------------------------------------
	*/
	public function _before_add() {
	}

	/**
	+----------------------------------------------------------
	* 排序前置
	+----------------------------------------------------------
	*/
	public function _before_sort() {
	}

	/**
	+----------------------------------------------------------
	* 默认插入前需要检验的字段
	+----------------------------------------------------------
	*/
	public function _filterInsertCheck() {
		$map['baid'] = $_REQUEST['baid'];
		return $map;
	}

	/**
	+----------------------------------------------------------
	* 默认更新前需要检验的字段
	+----------------------------------------------------------
	*/
	public function _filterUpdateCheck() {
		$map['baid'] = $_REQUEST['baid'];
		return $map;
	}

	/**
	+----------------------------------------------------------
	* 插入前置
	+----------------------------------------------------------
	*/
	public function _before_insert() {
	}

	/**
	+----------------------------------------------------------
	* 选择地区
	+----------------------------------------------------------
	*/
	public function selectArea() {
		$_result[] = array('0','请选择');
		if( !empty($_REQUEST['parent_id']) && $_REQUEST['parent_id'] != '请选择' ) {
			$result = D( $this->getActionName() )->where( array('status'=>'1','parent_id'=>$_REQUEST['parent_id']) )->order( 'baid' )->select();
			foreach( $result as $key=>$val )
				$_result[] = array( $val['baid'], $val['name'] );
		}
		$this->ajaxReturn( json_encode($_result), '', '', 'EVAL' );
	}

}
?>
